MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/mke16z/thirdparty/mke16z/periph/PERI_MSCAN.h
#define MSCAN_TSIDR1_TSID2_TSID0_MASK            (0xE0U)
#define MSCAN_TSIDR1_TSID2_TSID0_SHIFT           (5U)
/*! TSID2_TSID0 - Standard Format Identifier 2-0 */
#define MSCAN_TSIDR1_TSID2_TSID0(x)              (((uint8_t)(((uint8_t)(x)) << MSCAN_TSIDR1_TSID2_TSID0_SHIFT)) & MSCAN_TSIDR1_TSID2_TSID0_MASK)
/*! @} */

/*! @name TEIDR2 - Transmit Extended Identifier Register 2 */
/*! @{ */

#define MSCAN_TEIDR2_TEID14_TEID7_MASK           (0xFFU)
#define MSCAN_TEIDR2_TEID14_TEID7_SHIFT          (0U)
/*! TEID14_TEID7 - Extended Format Identifier 14-7 */
#define MSCAN_TEIDR2_TEID14_TEID7(x)             (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR2_TEID14_TEID7_SHIFT)) & MSCAN_TEIDR2_TEID14_TEID7_MASK)
/*! @} */

/*! @name TEIDR3 - Transmit Extended Identifier Register 3 */
/*! @{ */

#define MSCAN_TEIDR3_TERTR_MASK                  (0x1U)
#define MSCAN_TEIDR3_TERTR_SHIFT                 (0U)
/*! TERTR - Remote Transmission Request
 *  0b0..Data frame.
 *  0b1..Remote frame.
 */
#define MSCAN_TEIDR3_TERTR(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR3_TERTR_SHIFT)) & MSCAN_TEIDR3_TERTR_MASK)

#define MSCAN_TEIDR3_TEID6_TEID0_MASK            (0xFEU)
#define MSCAN_TEIDR3_TEID6_TEID0_SHIFT           (1U)
/*! TEID6_TEID0 - Extended Format Identifier 6-0 */
#define MSCAN_TEIDR3_TEID6_TEID0(x)              (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR3_TEID6_TEID0_SHIFT)) & MSCAN_TEIDR3_TEID6_TEID0_MASK)
/*! @} */

/*! @name TEDSR - Transmit Extended Data Segment Register N */
/*! @{ */

#define MSCAN_TEDSR_TDB_MASK                     (0xFFU)
#define MSCAN_TEDSR_TDB_SHIFT                    (0U)
/*! TDB - Data Bits */
#define MSCAN_TEDSR_TDB(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_TEDSR_TDB_SHIFT)) & MSCAN_TEDSR_TDB_MASK)
/*! @} */

/*! @name TDLR - Transmit Data Length Register */
/*! @{ */

#define MSCAN_TDLR_TDLC_MASK                     (0xFU)
#define MSCAN_TDLR_TDLC_SHIFT                    (0U)
/*! TDLC - Data Length Code Bits
 *  0b0000..0
 *  0b0001..1
 *  0b0010..2
 *  0b0011..3
 *  0b0100..4
 *  0b0101..5
 *  0b0110..6
 *  0b0111..7
 *  0b1000..8
 */
#define MSCAN_TDLR_TDLC(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_TDLR_TDLC_SHIFT)) & MSCAN_TDLR_TDLC_MASK)
/*! @} */

/*! @name TBPR - Transmit Buffer Priority Register */
/*! @{ */

#define MSCAN_TBPR_PRIO_MASK                     (0xFFU)
#define MSCAN_TBPR_PRIO_SHIFT                    (0U)
/*! PRIO - Priority */
#define MSCAN_TBPR_PRIO(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_TBPR_PRIO_SHIFT)) & MSCAN_TBPR_PRIO_MASK)
/*! @} */

/*! @name TTSRH - Transmit Time Stamp Register High */
/*! @{ */

#define MSCAN_TTSRH_TTS_MASK                     (0xFFU)
#define MSCAN_TTSRH_TTS_SHIFT                    (0U)
/*! TTS - Time Stamp */
#define MSCAN_TTSRH_TTS(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_TTSRH_TTS_SHIFT)) & MSCAN_TTSRH_TTS_MASK)
/*! @} */

/*! @name TTSRL - Transmit Time Stamp Register Low */
/*! @{ */

#define MSCAN_TTSRL_TTS_MASK                     (0xFFU)
#define MSCAN_TTSRL_TTS_SHIFT                    (0U)
/*! TTS - Time Stamp */
#define MSCAN_TTSRL_TTS(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_TTSRL_TTS_SHIFT)) & MSCAN_TTSRL_TTS_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group MSCAN_Register_Masks */


/*!
 * @}
 */ /* end of group MSCAN_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* MSCAN_H_ */

